index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-30 Mon 20:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Evan Bergeron" />
<link rel="stylesheet" type="text/css" href="no.css" />
</head>
<body>
<div id="content">
<p>
Hey, I´m Evan. Welcome to my slice of the internet.
</p>

<ul class="org-ul">
<li>My pet programming language <a href="http://dfa.io/thon">thon</a>.</li>
<li>A small tabletop rqg <a href="http://dfa.io/rqg">game system</a>.</li>
</ul>

<div id="outline-container-org04a56a5" class="outline-2">
<h2 id="org04a56a5">Arranging keys on my key holder is NP-hard</h2>
<div class="outline-text-2" id="text-org04a56a5">
<p>
2015-10-20
</p>

<p>
This past summer, I bought a key-holding gadget. There´s two screws on
either end that pierce through the keys. The keys fold in on each
other. I'm a little paranoia about losing my keys, so I figured it'd
be a good way to make sure I don't lose any of them.
</p>

<p>
But god forbid you ever have to change what keys you carry with you.
</p>

<p>
I just bought a USB drive to put on it (I recently had a snafu with
arch and had to chroot in. But I had to go a couple hours without my
laptop because I didn't have a boot USB on me. Never again).
</p>

<p>
Anyway.
</p>

<p>
30 minutes into the process of rearranging my keys so that the USB
drive would fit on it, I thought to myself: "this has to be NP-hard."
</p>

<p>
And indeed it is.
</p>

<p>
We reduce from PARTITION. (Really, they're nearly the same
problem). Take a second and gaze at the key holder on the linked
amazon page to get a sense for the problem. We want to arrange the
keys so that all keys fit on the keyring and there's no "tangling" of
keys in the middle.
</p>

<p>
Call the length of the key holder \(l\).
</p>

<p>
Suppose I give you a bunch of keys to put on the key holder. Each key
is very short - maybe \(\frac{l}{3}\). So the length of the keys won't
be an issue - it's mostly an issue of getting the heights to
match. The keys are of varying heights.
</p>

<p>
Certainly, the key holder needs to have equal height on each
end. Additionally, every key must be present (like, why would you even
buy one of these things if you're still going to have keys jangling
around)?
</p>

<p>
So then, if the sum of the heights of the keys is \(S\), each side of
the key holder must have height \(\frac{S}{2}\).
</p>

<p>
But this is just exactly PARTITION, which we know to be NP-complete.
</p>

<p>
Sigh. Wikipedia says that there's a pseudo-poly time dynamic
programming solution for PARTITION, which has led PARTITION to be
called "The Easiest Hard Problem".
</p>

<p>
Though to be frank, I don't know if I consider that to be much
condolence.
</p>
</div>
</div>

<div id="outline-container-org2e7c18a" class="outline-2">
<h2 id="org2e7c18a">Phone-a-Friend and SUPERHALTS</h2>
<div class="outline-text-2" id="text-org2e7c18a">
<p>
2015-04-09
</p>

<p>
Deciding things is hard. There are countably many Turing machines, but
an uncountable number of decision problems! Sometimes, maybe asking
our TM M for a decision is unreasonable - maybe sometimes we should
let him phone-a-friend. A reasonable question to ask is: if our friend
always gives us the right answer, is this enough?
</p>

<p>
We define the phone-a-friend mechanism as follows: our TM M is given
access to an <b>oracle</b>. The TM may ask the oracle a membership
question: is this string \\(w\\) in some set \\(S\\)? The oracle is
all-knowing and will return a yes or no answer immediately. The oracle
will always answer correctly. We call a Turing machine with access to
an oracle an <b>oracle Turing machine</b>.
</p>

<p>
So certainly, all of a sudden, life gets a lot easier! For example,
solving HALTS is trivial! Just ask the oracle. But here's an
interesting question: is there a decision problem that a Turing
machine can't solve, even when given an oracle to HALTS? Which is to
say, is there a problem that our TM M's friend <b>can't</b> know?
</p>

<p>
Unfortunately, (and maybe unsurprisingly), yes. Consider this
following problem, which we call \\(SUPERHALTS\\):
</p>

<p>
\\[ \\{(M, x) \| M\text{, with an oracle for the halting problem,
halts on x}\\} \\]
</p>

<p>
We can use the classic diagonalization argument to show that this is
undecidable. Suppose we have some oracle Turing machine \\(H\\) that
decides SUPERHALTS. Then we can define a new TM D to be:
</p>

<p>
D(X): If H(X, X) accepts with an oracle, then LOOP else ACCEPT
</p>

<p>
But then D(D) halts if and only if H(D, D) accepts. But H(D, D)
accepts iff D(D) loops! So we have that D(D) halts if and only if it
loops, a contradiction. Even if you've seen this argument before, take
a minute and reason through that last sentence. It's good for you.
</p>

<p>
So this is interesting. We've found a problem that's <b>harder than the
halting problem</b>. Significantly so. Which brings us to something
called <b>Turing degrees</b>. Computable functions have Turing
degree 1. Anything reducible to the halting problem has Turing
degree 2. The SUPERHALTS is our first problem with Turing greater than
two.
</p>

<p>
It's interesting how coarse a measurement Turing degree really
is. Obviously, it doesn't touch notions of complexity, with no regard
for the distinction between, say \(P\) and \(ELEMENTARY\). But
further, it doesn't even distinguish between Turing-decidable and
Turing-recognizable! (Or if you prefer, recursively enumerable). (A
Turing-recognizable set is similar to a decidable one, we just relax
the restriction that the TM must halt on all inputs).
</p>

<p>
So here's another question: is there any problem of intermediate
degree? Some problem that falls between HALTS and SUPERHALTS? This is
known as the <b>Post problem</b> (different from the Post Correspondence
Problem). And the answer, apparently, is yes.
</p>

<p>
The result involves something called a <b>priority ordering</b>. In a
priority ordering, we define some set \\(X\\). Then we make a
(potentially infinite) list of requirements. Each of these
requirements specifies whether or not some set of elements is in
\\(X\\). So we start with, say, the universe. Then requirement 1
specifies that elements in \\(X\\) must have some feature. And
requirement 2 does similarly. Maybe requirement \\(k\\) designates
that some element get thrown back into \\(X\\). And so on.
</p>

<p>
Anyway, this technique can be used to generate two problems A and B,
both of which can be solved with an oracle to the halting problem, but
neither can be solved with an oracle to the other! I guess you use the
priority ordering technique to forbid any Turing machine that would
reduce A to B or vice versa.
</p>

<p>
And into the world of non-computability we go! And you thought
complexity was bad&#x2026;
</p>
</div>
</div>
