index.html

<div id="outline-container-org0e4f018" class="outline-2">
<h2 id="org0e4f018">Traversing the Infinite Complete ω-nary Tree</h2>
<div class="outline-text-2" id="text-org0e4f018">
<p>
2016-03-03
</p>

<p>
The infinite complete &lt;span class="math inline"&gt;*ω*&lt;/span&gt;-nary tree is
one where every node has &lt;span class="math inline"&gt;ℕ&lt;/span&gt;-many
children. There are no leaves; the tree just extends downward
infinitely. Call this graph &lt;span class="math inline"&gt;𝔊&lt;/span&gt;.
</p>

<p>
We can't BFS or DFS over &lt;span class="math inline"&gt;𝔊&lt;/span&gt;. A DFS would
simply get stuck on the leftmost branch forever and a BFS would never
reach depth 2. How then are we to traverse it?
</p>

<p>
In the infinite complete <b>binary</b> tree, nodes are uniquely indentified
by a finite length binary string. In &lt;span class="math inline"&gt;𝔊&lt;/span&gt;,
nodes are uniquely indentified by a finite sequence of natural numbers.
Let &lt;span class="math inline"&gt;*s*(<b>v</b>)&lt;/span&gt; be &lt;span
class="math inline"&gt;*v*&lt;/span&gt;'s corresponding sequence. In &lt;span
class="math inline"&gt;𝔊&lt;/span&gt;, &lt;span class="math inline"&gt;*u*&lt;/span&gt; is
the parent of &lt;span class="math inline"&gt;*v*&lt;/span&gt; iff &lt;span
class="math inline"&gt;*s*(<b>u</b>)&lt;/span&gt;'s length is one less than &lt;span
class="math inline"&gt;*s*(<b>v</b>)&lt;/span&gt;'s' and &lt;span
class="math inline"&gt;*s*(<b>u</b>)&lt;/span&gt; is a prefix of &lt;span
class="math inline"&gt;*s*(<b>v</b>)&lt;/span&gt;.
</p>

<p>
Any tree traversal produces a well order on the tree's vertices. BFS on
the complete infinite binary tree is the shortlex ordering (sort first
by length, then lexographically). In fact, on level &lt;span
class="math inline"&gt;*i*&lt;/span&gt;, the set of corresponding binary strings
is the set of all &lt;span class="math inline"&gt;*i*&lt;/span&gt;-bit natural
numbers, and the nodes are visited in increasing order.
</p>

<p>
Further, any tree tree traversal has order type &lt;span
class="math inline"&gt;*ω*&lt;/span&gt;.
</p>

<p>
A traversal of &lt;span class="math inline"&gt;𝔊&lt;/span&gt; is a well order on the
nodes of &lt;span class="math inline"&gt;𝔊&lt;/span&gt;. What does this order look
like? Here's the idea (nodes are represented as int tuples):
</p>

<p>
{% highlight python %} def traverse(): visitedNextChild = {() : 0} while
True: currentlyVisited = visitedNextChild.keys() for v in
currentlyVisited: nextChild = v + (visitedNextChild\[v\],)
visit(nextChild) visitedNextChild\[v\] += 1
visitedNextChild\[nextChild\] = 0 {% endhighlight %} Here, We start with
the root node, which we can represent as the empty tuple. We maintain a
mapping from visited nodes to the next child of theirs to visit. At each
iteration, we visit each of the prescribed next children, and update the
mapping.
</p>

<p>
The fact that this visits every node in &lt;span
class="math inline"&gt;𝔊&lt;/span&gt; follows easily by induction.
</p>

<p>
In math symbols, if &lt;span class="math inline"&gt;*S*~*i*~&lt;/span&gt; is the set
of visited nodes at iteration &lt;span class="math inline"&gt;*i*&lt;/span&gt;, then
</p>

<p>
\
&lt;span class="math display"&gt;\\(\\) \\begin{align\*} S\<sub>i+1</sub> = S\<sub>i</sub> &amp;\&cup;
\\{s + 0 \\mid s \&isin; S\<sub>i</sub> \\} \\\\ &amp;\&cup; \\{s\<sub>1s</sub>\<sub>2\\ldots</sub>
(s\<sub>n</sub>+1)\\mid s\<sub>1s</sub>\<sub>2\\ldots</sub> s\<sub>n</sub> \&isin; S\<sub>i</sub> \\} \\end{align\*}
\$\$&lt;/span&gt;\
</p>

<p>
(there are totally duplicates being added here, but that's the beauty of
sets).
</p>

<p>
Fix the nodes &lt;span class="math inline"&gt;*u* = *s*~1~…*s*~*n* − 1~&lt;/span&gt;
and &lt;span class="math inline"&gt;*v* = *s*~1~…*s*~*n* − 1~*s*~*n*~&lt;/span&gt;.
Define &lt;span class="math inline"&gt;*t*(<b>x</b>)&lt;/span&gt; to be the iteration at
which &lt;span class="math inline"&gt;*x*&lt;/span&gt; is visited. Then &lt;span
class="math inline"&gt;*t*(<b>v</b>)=*t*(<b>u</b>)+*s*~*n*~ + 1&lt;/span&gt;. This leads to
this gorgeous fact:
</p>

<p>
&lt;span class="math inline"&gt;*s*~1~…*s*~*n*~&lt;/span&gt; is visited at iteration
&lt;span class="math inline"&gt;\$\&sum;\<sub>i=1</sub>\<sup>n</sup> (s\<sub>i</sub> + 1) = n +
\&sum;\<sub>i=1</sub>\<sup>n</sup> s\<sub>i</sub>\$&lt;/span&gt;.
</p>

<p>
This means that our tree traversal has a pretty interesting
sub-relation: namely that &lt;span class="math inline"&gt;*u* &amp;lt; *v*&lt;/span&gt;
if &lt;span class="math inline"&gt;*u*&lt;/span&gt;'s length + &lt;span
class="math inline"&gt;*u*&lt;/span&gt;'s digit sum is less than &lt;span
class="math inline"&gt;*v*&lt;/span&gt;'s length + &lt;span
class="math inline"&gt;*v*&lt;/span&gt;'s digit sum. Or, (if we one-index), just
the digit sums.
</p>

<p>
From here on out, we'll one-index for simplicity's sake. (That is,
assume &lt;span class="math inline"&gt;ℕ&lt;/span&gt; starts at 1).
</p>

<p>
Let's see if we can characterize the entire ordering. (That is, instead
of building a relation based on iteration, build a relation built on
precise ordering of traversal).
</p>

<p>
It's exactly the same relation, but if they tied, you recurse on the
largest proper prefix of each.
</p>

<p>
{% highlight python %} def lessThan(u, v): \# u &amp;lt; v return
digitSum(u) &amp;lt; digitSum(v) or lessThan(u\[::-1\], v\[::-1\]) {%
endhighlight %}
</p>

<p>
So the empty sequence is the least element (as we visit the root of
&lt;span class="math inline"&gt;𝔊&lt;/span&gt; first). I'm fairly certain that if
you create the corresponding &lt;span class="math inline"&gt;≤&lt;/span&gt;
relation, this becomes a total order.
</p>

<p>
Here's the cool thing: we've produced an order on &lt;span
class="math inline"&gt;ℕ^\*^&lt;/span&gt; that has order type &lt;span
class="math inline"&gt;*ω*&lt;/span&gt;! (The normal shortlex trick doesn't work
when our alphabet is countably infinite).
</p>

<p>
In general, if we want to produce an ordering of order type &lt;span
class="math inline"&gt;*ω*&lt;/span&gt; on\
&lt;span class="math display"&gt;ℕ^\*^&lt;/span&gt;\
, it suffices to partition &lt;span class="math inline"&gt;ℕ^\*^&lt;/span&gt; into
countably many partitions, each of finite size. Then the
"concatentation" of these partitions yields order type &lt;span
class="math inline"&gt;*ω*&lt;/span&gt;.
</p>

<p>
Just some fun observations :)
</p>


<p>
[Some comments on learning Chinese](/chinese.html)
</p>

<p>
[Some books I like](/books.html)
</p>
</div>
</div>
<div id="outline-container-org0270743" class="outline-2">
<h2 id="org0270743">Tools for long-form reading Chinese as a second language</h2>
<div class="outline-text-2" id="text-org0270743">
<p>
2018-01-04, updated 2020-05-17
</p>

<p>
Study what you want to know. Do you want to pass standardized exams?
If so, study those vocab lists. Do you want to read a book? If so,
collect a list of the most frequently used words in the book and study
those.
</p>

<p>
Collecting vocab from books.
</p>

<p>
Open a txt file of the book you want to read in
ChineseTextAnalyzer. For popular books, googling the Chinese title and
´mobi´ or ´txt´ usually turns up a copy of the book. will
</p>

<p>
ChineseTextAnalyzer splits the file up into words (presumably with
longest-match against CC-CEDICT). Based on a set of 'known words,'
ChineseTextAnalyzer can give you a list of unknown words, sorted by
frequency of appearance in the text. It's then super easy to export
these words into a CSV file and import into Anki.
</p>

<p>
I find this method of gathering vocab to be much more motivating that
studying lists of words from a textbook. This way, I get longer-form
reading with content I'm interested in, and a vocab list
custom-tailored to the content I want to consume.
</p>

<p>
(Shout out to the incredible 书博 for telling me about this one).
</p>
</div>
