index.html

<div id="outline-container-orgb4b2535" class="outline-3">
<h3 id="orgb4b2535">Define-on-highlight in Kindle (with pinyin)</h3>
<div class="outline-text-3" id="text-orgb4b2535">
<p>
I consider highlight-on-lookup an essential feature for reading 'real'
Chinese long-form material. I don't have the patience to handwrite
characters into Pleco every time I don't understand what's going
on. Finding a good mobi file for the English-Chinese dictionary
CC-CEDICT does wonders.
</p>

<p>
I put this file in the documents/dictionaries directory on my Kindle;
it might be different for your e-reader. If your e-reader doesn't
support mobi, I suggest the wonderful tool ebook-convert as a means to
convert it to epub.
</p>

<p>
This isn't a perfect solution; CC-CEDICT is probably my least favorite
English-Chinese dictionary around, but I have been unable to find any
other dictionaries in electronic form. The Kindle has a
English-Chinese dictionary by default, but for baffling reasons, it
does not include pinyin.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb1a65ed" class="outline-2">
<h2 id="orgb1a65ed">Some books I've read, enjoyed, and would recommend.</h2>
<div class="outline-text-2" id="text-orgb1a65ed">
<p>
<b>Coders, the Making of a New Tribe.</b>
</p>

<p>
A book on programmer culture over the years. The author knows how to code some, but is not a programmer by trade. There's discussion programmer mental health, gender inequality, and social norms. The chapter 'The ENIAC girls' taught me that programming was originally a largely female profession. There is discussion of the bootcamp phenomenon.
</p>

<p>
The book made me think about the culture of the industry I work in. I
recommended it.
</p>

<p>
<b>More Happy Than Not</b>
</p>

<p>
A queer love story with a surrealist twist. The first queer fiction
I've sought out.
</p>

<p>
<b>Goodbye, Things</b>
</p>

<p>
One of my favorite books on minimalism. The author is open about his
insecurities and the ways in which he would use things to compensate:
abstruse books to seem literary, a big TV to seem like a film
enthusiast.
</p>
</div>
</div>
<div id="outline-container-org9f5e71c" class="outline-2">
<h2 id="org9f5e71c">Nice things to cook and eat</h2>
<div class="outline-text-2" id="text-org9f5e71c">
</div>
<div id="outline-container-org0cff9fe" class="outline-3">
<h3 id="org0cff9fe">Fried rice</h3>
<div class="outline-text-3" id="text-org0cff9fe">
<p>
I've made this well over 10 times, maybe 20. Not a lifetime of
refinement, but enough to have a couple details I try to include:
</p>

<ul class="org-ul">
<li>Let the rice sit on the pan for a while so it gets real crispy.</li>
<li>Fry the egg whites separately from the yolk for varied texture and color.</li>
</ul>

<p>
Couple different flavor profiles:
</p>

<ul class="org-ul">
<li>Fish sauce (tablespoon per block of tofu), light rice vinegar,
cilantro, mint, jalapenos (and fermented jalapeno sauce), crab,
kumquats.</li>
<li>Soy sauce, dark rice vinegar, shaoxing rice wine, chili oil.</li>
</ul>

<p>
I usually just fry up a block of tofu and stick it in with the veggies.
</p>

<p>
Tips to prep before:
</p>

<ul class="org-ul">
<li>Chooped boy choy and carrots keep nicely in the fridge.</li>
</ul>

<p>
Haven't found a tofu marinade I like much. It seems to make it wetter,
which prevents it from getting crispy in the frier. 
</p>
</div>
</div>

<div id="outline-container-orgb2d1101" class="outline-3">
<h3 id="orgb2d1101">Bread</h3>
<div class="outline-text-3" id="text-orgb2d1101">
<p>
I've made the Joy of Cooking white bread recipe several times and
have enjoyed it. It toasts up well nicely on a cast iron pan, as
well.
</p>
</div>
</div>

<div id="outline-container-org34084c7" class="outline-3">
<h3 id="org34084c7">Cinnamon-garlic-ginger garbonzo bean soup</h3>
<div class="outline-text-3" id="text-org34084c7">
<p>
Amanda's always been the one to make this, I can't claim to know how
to make it offhand. That's a TODO haha.
</p>
</div>
</div>

<div id="outline-container-orgf8e6e9d" class="outline-3">
<h3 id="orgf8e6e9d">Slow cooked pork</h3>
<div class="outline-text-3" id="text-orgf8e6e9d">
<p>
Cut pork shoulder into about 3x3x3 inch blocks. Place in slow cooker
with a half cup water and a half teaspoon salt for each pound of
meat. Cook on low for 8 hours. Fries up nicely.
</p>

<p>
Keeps in the fridge for a couple days, I didn't get sick eating it 3
days later (having cooked it on the sell-by date).
</p>
</div>
</div>

<div id="outline-container-orgc423bfd" class="outline-3">
<h3 id="orgc423bfd">Larder</h3>
<div class="outline-text-3" id="text-orgc423bfd">
</div>
<div id="outline-container-orgb69eebf" class="outline-4">
<h4 id="orgb69eebf">Lacto-fermented hot sauces</h4>
<div class="outline-text-4" id="text-orgb69eebf">
<p>
I've tried this with jalapenos and have some poblanos and serranos
going at the time of writing.
</p>

<p>
Stem and seed about a pount of peppers. Puree. Add salt (0.075 x the
weight of pepper puree). Stir. Place in big mason jar, wait 4 weeks.
</p>

<p>
Be sure the peppers are totally covered by the brine. Feel free to add
more brine if needed (not sure how the added brine strategy plays out,
that's still a WIP).
</p>

<p>
At the end of the 4 weeks, place the pepper puree in some vinegar
(TODO how much?) and briefly boil. Keeps in the fridge for about 6
months, apparently.
</p>
</div>
</div>

<div id="outline-container-org1e0b2bc" class="outline-4">
<h4 id="org1e0b2bc">Chili Oil</h4>
<div class="outline-text-4" id="text-org1e0b2bc">
<p>
Still new to me, on my second try.
</p>

<ul class="org-ul">
<li>Canola Oil (obv not ideal)</li>
<li>Chinese dried peppers (not sure on the details)</li>
<li>Sichuan peppercorns, toasted and ground</li>
<li>Anise, toasted and ground.</li>
</ul>

<p>
Some tweaks and things to try:
</p>

<ul class="org-ul">
<li>Use a peanut oil of Chinese manufacture.</li>
<li>Experiment with different dried peppers</li>
<li>This second time I tried soaking the peppers in water after
toasting, as if I was making mole. I also chopped the peppers into
small rings.</li>
<li>More "five spices" - fennel, cloves, and (cassia?) cinnamon.</li>
<li>Fried soybeans</li>
</ul>
</div>
</div>

<div id="outline-container-orgf8824c8" class="outline-4">
<h4 id="orgf8824c8">Salsas</h4>
<div class="outline-text-4" id="text-orgf8824c8">
<p>
My fave is wrapping garlic, tomatillos, and serranos in some foil and
heating in a pan for maybe 20-30 mins, then puree-ing with some salt
and lime.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Evan Bergeron</p>
<p class="date">Created: 2020-11-30 Mon 20:41</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
